Тест1/src/AccumulationRegisters/дт_НачислениеЗарплатыУУ/дт_НачислениеЗарплатыУУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>дт_НачислениеЗарплатыУУ</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчета</name>
    <type>
      <types>CatalogRef.дт_ВидыРасчетовЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест1/src/AccumulationRegisters/дт_НачислениеЗарплатыБУ/дт_НачислениеЗарплатыБУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>дт_НачислениеЗарплатыБУ</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест1/src/AccumulationRegisters/ОтработанноеВремя/ОтработанноеВремя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОтработанноеВремя</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДня</name>
    <type>
      <types>EnumRef.ТипыДнейТабеля</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест1/src/InformationRegisters/дт_НачисленияФиксированныеПлан/дт_НачисленияФиксированныеПлан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дт_НачисленияФиксированныеПлан</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчета</name>
    <type>
      <types>CatalogRef.дт_ВидыРасчетовЗарплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест1/src/InformationRegisters/ПараметрыДолжностей/ПараметрыДолжностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыДолжностей</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидАналитики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормироватьОтработанноеВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиПредприятия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест1/src/Enums/ТипыДнейТабеля/ТипыДнейТабеля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДнейТабеля</name>
  <enumValues>
    <name>РабочийДень</name>
  </enumValues>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>Административный</name>
  </enumValues>
  <enumValues>
    <name>Больничный</name>
  </enumValues>
  <enumValues>
    <name>Выходной</name>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
  </enumValues>
</mdclass:Enum>

Тест1/src/Enums/СпособыНачисленияОклада/СпособыНачисленияОклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНачисленияОклада</name>
  <enumValues>
    <name>ПоЧасам</name>
  </enumValues>
  <enumValues>
    <name>ПоДням</name>
  </enumValues>
</mdclass:Enum>

Тест1/src/CommonModules/дт_Зарплата/Module.bsl
#Область ПрограммныйИнтерфейс
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ДатаНачалаУчетаОплатПоСделкам() Экспорт

	
	Возврат '20180301';

КонецФункции // ДатаНачалаУчетаОплатПоСделкам()


// Выполняет движения регистра накопления дт_НачислениеЗарплатыУУ
//
Процедура ОтразитьНачислениеЗарплаты(ПараметрыПроведения, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ПараметрыПроведения.ТаблицаНачислениеЗарплаты;
	Если Отказ
	 ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	ДвиженияНабор = Движения.дт_НачислениеЗарплатыУУ;
	ДвиженияНабор.Записывать = Истина;
	ДвиженияНабор.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры

// Выполняет движения регистра накопления дт_НачислениеЗарплатыБУ
//
Процедура ОтразитьНачислениеЗарплатыБУ(ПараметрыПроведения, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ПараметрыПроведения.ТаблицаНачислениеЗарплатыБУ;
	Если Отказ
	 ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	ДвиженияНабор = Движения.дт_НачислениеЗарплатыБУ;
	ДвиженияНабор.Записывать = Истина;
	ДвиженияНабор.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры


// Выполняет движения регистра накопления ОтработанноеВремя
//
Процедура ОтразитьОтработанноеВремя(ПараметрыПроведения, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ПараметрыПроведения.ТаблицаОтработанноеВремя;
	Если Отказ
	 ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	ДвиженияНабор = Движения.ОтработанноеВремя;
	ДвиженияНабор.Записывать = Истина;
	ДвиженияНабор.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры



// Выполняет движения регистра накопления ДолжностиСотрудников
//
Процедура ОтразитьДолжностиСотрудников(ПараметрыПроведения, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ПараметрыПроведения.ТаблицаДолжностиСотрудников;
	Если Отказ
	 ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	ДвиженияНабор = Движения.ДолжностиСотрудников;
	ДвиженияНабор.Записывать = Истина;
	ДвиженияНабор.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры


// Выполняет движения регистра накопления дт_НачисленияФиксированныеПлан
//
Процедура ОтразитьНадбавкиПлан(ПараметрыПроведения, Движения, Отказ) Экспорт
	
	ТаблицаДвижения = ПараметрыПроведения.ТаблицаНадбавки;
	Если Отказ
	 ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	ДвиженияНабор = Движения.дт_НачисленияФиксированныеПлан;
	ДвиженияНабор.Записывать = Истина;
	ДвиженияНабор.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры

Функция ПолучитьВремяПоТабелю(Сотрудник, НачалоПериода, КонецПериода, ТипДня = Неопределено, Способ = Неопределено) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтработанноеВремяОбороты.Период КАК Период,
		|	ОтработанноеВремяОбороты.КоличествоОборот КАК Количество
		|ИЗ
		|	РегистрНакопления.ОтработанноеВремя.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			День,
		|			Сотрудник = &Сотрудник
		|				И ТипДня = &ТипДня) КАК ОтработанноеВремяОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ТипДня", ?(ТипДня = Неопределено, Перечисления.ТипыДнейТабеля.РабочийДень, ТипДня));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Результат = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Способ = Перечисления.СпособыНачисленияОклада.ПоЧасам Тогда
			Результат = Результат + ВыборкаДетальныеЗаписи.Количество;
		Иначе
			Результат = Результат + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	

КонецФункции // ПолучитьОтработанноеВремя()

Функция ПолучитьРабочееВремяПоКалендарю(Календарь, НачалоПериода, КонецПериода, Способ) Экспорт
	
	Результат = 0;
	РабочиеДни = ГрафикиРаботы.РасписанияРаботыНаПериод(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Календарь),
		НачалоПериода,
		КонецПериода
	);
	
	ПредДень = Неопределено;
		
	Для каждого РабочийДень Из РабочиеДни Цикл
	
		Результат = Результат + 
			?(Способ = Перечисления.СпособыНачисленияОклада.ПоДням,
				?(РабочийДень.ДатаГрафика = ПредДень, 0, 1),
				?(ЗначениеЗаполнено(РабочийДень.ВремяНачала), (РабочийДень.ВремяОкончания - РабочийДень.ВремяНачала) / 3600, 8)  // в часах 
			);
		ПредДень = РабочийДень.ДатаГрафика;
		
	КонецЦикла;
		
	Возврат Результат;	
			
КонецФункции
		
Функция ПолучитьКадровыеДанные(Сотрудник, Дата = Неопределено, Организация = Неопределено, Подразделение = Неопределено, ПолучитьВсеДанные = Ложь) Экспорт
	
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолжностиСотрудниковСрезПоследних.Организация,
	|	ДолжностиСотрудниковСрезПоследних.Подразделение,
	|	ДолжностиСотрудниковСрезПоследних.Должность,
	|	ДолжностиСотрудниковСрезПоследних.Период,
	|	ДолжностиСотрудниковСрезПоследних.ДатаОформления,
	|	ДолжностиСотрудниковСрезПоследних.ОкладБУ,
	|	ДолжностиСотрудниковСрезПоследних.Оклад
	|ПОМЕСТИТЬ втИстория
	|ИЗ
	|	РегистрСведений.ДолжностиСотрудников.СрезПоследних(&Дата, &Отбор) КАК ДолжностиСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИстория.Организация,
	|	МАКСИМУМ(втИстория.Период) КАК Период
	|ПОМЕСТИТЬ втДатыСреза
	|ИЗ
	|	втИстория КАК втИстория
	|СГРУППИРОВАТЬ ПО
	|	втИстория.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИстория.Организация,
	|	втИстория.Подразделение,
	|	втИстория.Должность,
	|	втИстория.ДатаОформления,
	|	втИстория.Период КАК ДатаПриема,
	|	втИстория.ОкладБУ,
	|	втИстория.Оклад
	|ИЗ
	|	втИстория КАК втИстория
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДатыСреза КАК втДатыСреза
	|		ПО втИстория.Организация = втДатыСреза.Организация
	|		И втИстория.Период = втДатыСреза.Период
	|		И НЕ втИстория.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|		И НЕ втИстория.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиПредприятия.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	втИстория.Период УБЫВ";

	Отбор = "Сотрудник = &Сотрудник";
	Если Организация <> Неопределено Тогда
		
		Отбор = Отбор + " И Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", Организация);
		
	КонецЕсли;
	
	Если Подразделение <> Неопределено Тогда
		
		Отбор = Отбор + " И Подразделение = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор", Отбор);
	
	Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, ТекущаяДата(), Дата));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результаты = РезультатЗапроса.Выгрузить();
	
	Если ПолучитьВсеДанные Тогда
		Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(Результаты);
		
		
	ИначеЕсли Организация = Неопределено И Подразделение = Неопределено Тогда
		Результат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результаты[0]);
		
	Иначе
		Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(Результаты);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьГоловноеПодразделение(Подразделение) Экспорт
	
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "Родитель");
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		Возврат ПолучитьГоловноеПодразделение(Родитель);
	КонецЕсли;
		
	Возврат Подразделение;
	
КонецФункции

Функция ПолучитьСтавкуСотрудника(Сотрудник, Дата) Экспорт

	ПараметрыДолжности = ПолучитьПараметрыДолжности(Сотрудник, Дата);
	
	Если ПараметрыДолжности = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ПараметрыДолжности.Ставка;
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьПараметрыДолжности(Сотрудник, Дата, КадровыеДанные = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	Если КадровыеДанные = Неопределено Тогда
		КадровыеДанные = ПолучитьКадровыеДанные(Сотрудник, Дата);
	КонецЕсли;	
	
	Если КадровыеДанные = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
		
	Должность = КадровыеДанные.Должность;	
	
	Если Не ЗначениеЗаполнено(Должность) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Должность, "СпособНачисленияОклада,СпособНачисленияПремии"
		+ ",СпособНачисленияСдельнойОплаты,Календарь,ПрофильПоказателей,ВычитатьНеявкиИзСдельнойОплаты"
	);
	
	Срез = РегистрыСведений.ПараметрыДолжностей.СрезПоследних(Дата, Новый Структура("Должность", Должность));
	
	Если Срез.Количество() <> 0 Тогда
		
		// Оклад сотрудника приоритетнее оклада по должности
		ПараметрыДолжности = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Срез[0]);
		
		Если КадровыеДанные.Оклад <> 0 Тогда
			ПараметрыДолжности.Оклад = КадровыеДанные.Оклад; 	
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Результат, 
			ПараметрыДолжности,
			Истина
		);
	Иначе	
		
		Результат.Вставить("Оклад", КадровыеДанные.Оклад);
		Результат.Вставить("Ставка", 0);
		Результат.Вставить("Процент", 0);
		Результат.Вставить("ВидАналитики", Неопределено);
		
	КонецЕсли;
	
	
	Возврат Результат;
	
КонецФункции	
		
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
